lib/tasks/dev.rake

  task add_default_admin: :environment do
    Admin.create!(
      email: 'admin@admin.com',
      password: '123admin',
      password_confirmation: '123admin'
    )
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  task add_extra_admin: :environment do
    10.times do |i|
      Admin.create!(
        email: Faker::Internet.email,
        password: DEFAULT_PASSWORD,
        password_confirmation: DEFAULT_PASSWORD
      )
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  task add_default_user: :environment do
    User.create!(
      email: 'user@user.com',
      password: '123user',
      password_confirmation: '123user'
    )
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)