app/views/admins_backoffice/questions/index.html.erb

          <%= form.label "Tópico" %>
          <%= form.collection_select :topic_id, Topic.all, :id, :name, { include_blank: true }, { class: "form-control" } %>
---
SELECT "topics".* FROM "topics"