app/controllers/admins_backoffice/admins_controller.rb

  def index
    @admins = Admin.all.page(params[:page]).per(5)
---
SELECT "admins".* FROM "admins"
SELECT COUNT(*) FROM "admins"

  def create
    @admin = Admin.new(params_adm_permited)
    if @admin.save
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
    if @admin.update(params_adm_permited)
---
UPDATE "admins" SET "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["encrypted_password", "$2a$12$0PRJlnmGioSS1MCddjplGeF.tJCXV15adHcpRQpZKtS17apz7/e2G"], ["updated_at", "2022-01-19 15:01:49.327074"], ["id", 7]]

  def destroy
    if @admin.destroy
---
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 4]]

  def set_admin_id
    @admin = Admin.find(params[:id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]