app/controllers/admins_backoffice/questions_controller.rb

SELECT "questions".* FROM "questions" ORDER BY "questions"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT "topics".* FROM "topics" WHERE "topics"."id" IN (?, ?)  [["id", 8], ["id", 4]]
SELECT COUNT(*) FROM "questions"
---
  def index
    # Making Question recognize topics {.include(:topic)}
    @questions = Question.includes(:topic).order(:description).page(params[:page]).per(5)

INSERT INTO "questions" ("description", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Qual a rede social que mais gera dinheiro em 2022?"], ["topic_id", 8], ["created_at", "2022-01-24 17:41:32.469711"], ["updated_at", "2022-01-24 17:41:32.469711"]]
---
  def create
    @question = Question.new(params_question_permited)
    if @question.save

DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 2]]
---
  def destroy
    if @question.destroy

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_question_id
    @question = Question.find(params[:id])