app/controllers/admins_backoffice/topics_controller.rb

  def index
    @topics = Topic.all.order(:description).page(params[:page]).per(5)
---
SELECT "topics".* FROM "topics" ORDER BY "topics"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "topics"

  def create
    @topic = Topic.new(params_topic_permited)
    if @topic.save
---
INSERT INTO "topics" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Tecnologia"], ["created_at", "2022-01-20 14:41:25.818335"], ["updated_at", "2022-01-20 14:41:25.818335"]]

  def update
    if @topic.update(params_topic_permited)
---
UPDATE "topics" SET "description" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["description", "Tecnologia e Inovação"], ["updated_at", "2022-01-20 14:45:57.752531"], ["id", 1]]

  def destroy
    if @topic.destroy
---
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]

  def set_topic_id
    @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]