app/views/admins_backoffice/questions/shared/_form.html.erb

SELECT "topics".* FROM "topics"
---
      <%# AQUIIIIIIIIIIIII %>
      <%= form.collection_select(:topic_id, Topic.all, :id, :description, {}, { class: "form-control" }) %>