app/controllers/site/search_controller.rb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]
SELECT "questions".* FROM "questions" WHERE (lower(description) LIKE '%azul%') LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def questions
    @questions = Question.includes(:answers)
                         .where("lower(description) LIKE ?", "%#{params[:term].downcase}%")
                         .page(params[:page]).per(5)