app/views/site/shared/_questions.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]
---
          <ul>
            <% question.answers.each do |answer|%>