app/views/site/welcome/index.html.erb

          <ul>
            <% question.answers.each do |answer|%>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]